Repository: knyghtmare/Nightfall_Bastion
Catalog: translations/wesnoth-Nightfall_Bastion/*.po
Languages: bn

source: Nightfall Bastion
bn: নাইটফল ব্যাস্টিয়ন

source: In the age-old Silver Lands of the Great Continent, the eternal Monarchy faces a pivotal moment. The vampire lord of Nightfall Bastion is besieged by crusaders from a human kingdom. This confrontation begs the question: will the vampires' superior strength triumph, or will the crusaders' determination lead them to victory?
bn: মহাদেশের প্রাচীন রৌপ্য ভূমিতে, চিরন্তন রাজতন্ত্র এক গুরুত্বপূর্ণ মুহূর্তের মুখোমুখি। নাইটফল ব্যাস্টিয়নের ভ্যাম্পায়ার প্রভু এক মানব রাজ্যের ক্রুসেডারদের দ্বারা ঘেরাও হয়েছে। এই সংঘর্ষে প্রশ্ন উঠেছে: ভ্যাম্পায়ারদের শ্রেষ্ঠ শক্তি জয়ী হবে, নাকি ক্রুসেডারদের দৃঢ় সংকল্প তাদের জয়ের দিকে নিয়ে যাবে?

source: (Expert Level, 1 scenario)
bn: (বিশেষজ্ঞ স্তর, ১টি সিনারিও)

source: This scenario features the Vampires.
bn: এই সিনারিওতে ভ্যাম্পায়াররা উপস্থিত আছে।

source: This scenario accepts donations on Ko-fi: https://ko-fi.com/tahsinjahinkhalid
bn: এই সিনারিও কো-ফাইতে দান গ্রহণ করে: https://ko-fi.com/tahsinjahinkhalid

source: Feedback: https://discord.gg/rsePgjHRPA (Wesnoth Modders Guild)
bn: প্রতিক্রিয়া: https://discord.gg/rsePgjHRPA (ওয়েসনথ মডার্স গিল্ড)

source: Requires <i>War of Legends</i> to be installed
bn: <i>ওয়ার অফ লিজেন্ডস</i> ইনস্টল করা প্রয়োজন

source: Fighter
bn: যোদ্ধা

source: Challenging
bn: চ্যালেঞ্জিং

source: Commander
bn: কমান্ডার

source: Difficult
bn: কঠিন

source: Lord
bn: লর্ড

source: Nightmare
bn: দুঃস্বপ্ন

source: Author and Scenario Designer
bn: লেখক ও সিনারিও ডিজাইনার

source: Tahsin Jahin Khalid (Lord-Knyghtmare)
bn: তাহসিন জাহিন খালিদ (লর্ড-নাইটমেয়ার)

source: Defender of the Bastion
bn: ব্যাস্টিয়নের রক্ষক

source: Completed the scenario <i>Nightfall Bastion</i>.
bn: <i>নাইটফল ব্যাস্টিয়ন</i> সিনারিও সম্পূর্ণ করেছে।

source: Sentinel of the Bastion
bn: ব্যাস্টিয়নের প্রহরী

source: Completed the scenario <i>Nightfall Bastion</i> on the highest difficulty.
bn: <i>নাইটফল ব্যাস্টিয়ন</i> সিনারিও সর্বোচ্চ কঠিনাই মাত্রায় সম্পূর্ণ করেছে।

source: blitz
bn: ব্লিৎজ

source: This unit can attack twice in one turn.
bn: এই ইউনিট এক পালায় দুইবার আক্রমণ করতে পারে।

source: Potion of Blood
bn: রক্তের পোশাক

source: This elixir, distilled from the essence of lifeblood itself, possesses the arcane power to mend our battle-worn flesh and restore our waning vigor.
bn: জীবনের রক্তের সারাংশ থেকে নির্যাসিত এই অমৃত, যুদ্ধ-ক্লান্ত দেহ মেরামত এবং ক্ষীণ শক্তি পুনরুদ্ধারের জন্য গুপ্ত শক্তি রাখে।

source: <span fgcolor='grey'><b>Fully heals the drinker.</b></span>
bn: <span fgcolor='grey'><b>পান করার ফলে পুরোপুরি সুস্থ হয়ে যায়।</b></span>

source: Drink It
bn: এটি পান করুন

source: Refuse It
bn: এটি প্রত্যাখ্যান করুন

source: Potion of Unknown Effect
bn: অজানা প্রভাবের পোশাক

source: It is not certain what effect this yellowish liquid can have on the drinker
bn: এই হলুদাভ তরলের পানকারীর উপর কী প্রভাব ফেলতে পারে তা নিশ্চিত নয়

source: <span fgcolor='grey'><b>Effect Not Known</b></span>
bn: <span fgcolor='grey'><b>প্রভাব অজানা</b></span>

source: Strange Amulet
bn: অদ্ভুত তাবিজ

source: This amulet, forged from the bones of a mystical creature, hums with ancient energy; merely touching it suffuses one with a rejuvenating aura of untold power.
bn: এই তাবিজটি, এক রহস্যময় প্রাণীর হাড় দিয়ে গড়া, প্রাচীন শক্তি দ্বারা গুঞ্জন করে; কেবল এটি স্পর্শ করলেই অবর্ণনীয় শক্তির এক পুনরুজ্জীবিত আভা দেহে ছড়িয়ে পড়ে।

source: <span fgcolor='grey'><b>Gain Blitz Ability</b></span>
bn: <span fgcolor='grey'><b>ব্লিৎজ ক্ষমতা অর্জন</b></span>

source: Wear It
bn: এটি পরুন

source: Leave It
bn: এটি ছেড়ে দিন

source: Underground (Illuminated)
bn: ভূগর্ভস্থ (আলোকিত)

source: In the Silver Lands of the Great Continent, Nightfall Bastion, a fortress steeped in history and under occupation by the vampires, stands as a symbol of the eternal Monarchy's power. Built from enchanted stones and holding centuries of vampire legacy, the Bastion has been an unbreachable sanctuary.
bn: মহাদেশের রৌপ্য ভূমিতে, নাইটফল ব্যাস্টিয়ন, একটি ঐতিহাসিক দুর্গ এবং ভ্যাম্পায়ারদের দখলে, চিরন্তন রাজতন্ত্রের ক্ষমতার প্রতীক হিসেবে দাঁড়িয়ে আছে। মায়াবী পাথর দিয়ে নির্মিত এবং শতাব্দীর ভ্যাম্পায়ার ঐতিহ্য ধারণকারী, ব্যাস্টিয়ন একটি অভেদ্য আশ্রয় হয়ে আছে।

source: However, it now faces a dire threat. A determined army of crusaders from the human kingdoms has laid siege to the fortress, challenging the vampires' might with their unwavering faith and strategic skill. As tensions rise, the fate of Nightfall Bastion hangs in the balance, poised between the vampires' ancient strength and the crusaders' resolve...
bn: তবে এখন এটি এক ভয়াবহ হুমকির মুখোমুখি। মানব রাজ্যের এক সংকল্পবদ্ধ ক্রুসেডার সেনাবাহিনী দুর্গটিকে ঘেরাও করেছে, ভ্যাম্পায়ারদের শক্তির সাথে তাদের অটল বিশ্বাস এবং কৌশলগত দক্ষতার চ্যালেঞ্জ জানিয়েছে। চাপ বাড়ার সাথে সাথে, নাইটফল ব্যাস্টিয়নের ভাগ্য দোলাচলে রয়েছে, ভ্যাম্পায়ারদের প্রাচীন শক্তি এবং ক্রুসেডারদের দৃঢ় সংকল্পের মাঝে দাঁড়িয়ে।

source: Lord Jarlath
bn: লর্ড জারলাথ

source: team_name^Vampires
bn: ভ্যাম্পায়াররা

source: team_name^Loyalists
bn: অনুগতজন

source: Defeat the Crusaders
bn: ক্রুসেডারদের পরাজিত করুন

source: Defeat of Lord Jarlath
bn: লর্ড জারলাথের পরাজয়

source: What urgent matter disrupts my eternal contemplation? Speak swiftly.
bn: কোন জরুরি বিষয় আমার চিরন্তন চিন্তাধারাকে ব্যাহত করেছে? দ্রুত বলুন।

source: My Sovereign! Our sanctum is under siege! The daywalkers have amassed, their intent clear; our annihilation!
bn: আমার সম্রাট! আমাদের পবিত্র স্থান ঘেরাও অবস্থায় রয়েছে! দিনের প্রহরীরা জমায়েত হয়েছে, তাদের উদ্দেশ্য স্পষ্ট; আমাদের ধ্বংস!

source: Ah, the mortals dare challenge the night itself? How... quaintly amusing...
bn: আহ, মর্ত্যজনেরা রাত্রির নিজের সাথে চ্যালেঞ্জ নিয়েছে? কী... অদ্ভুত মজার...

source: Children of the Eternal Eclipse! Rise! Let us enlighten these veinborn pretenders on the folly of their insolence against their ageless overlords!
bn: চিরন্তন গ্রহণের সন্তানেরা! উঠুন! আসুন আমরা এই রক্তজাত প্রতারকদের তাদের অহংকারের মূর্খতা সম্পর্কে অবহিত করি এবং তাদের অকালজাত অধিপতিদের বিরুদ্ধে বিদ্রোহের ফল দেখাই।

source: Courageous warriors, today we stand united, not for glory, but for a righteous cause. Our strength is our unyielding spirit and unwavering faith. In the face of darkness, we are the bearers of light, guardians of the innocent. As we march into battle, let our shared conviction guide and protect us. Together, we fight for our families, our people, and a future bathed in light. Onward, for a victory that will echo through the ages!
bn: সাহসী যোদ্ধারা, আজ আমরা একত্রিত হয়েছি, গৌরবের জন্য নয়, বরং একটি ধর্মীয় উদ্দেশ্যের জন্য। আমাদের শক্তি হল আমাদের অনমনীয় আত্মা এবং অবিচল বিশ্বাস। অন্ধকারের মুখোমুখি, আমরা আলোর বাহক, নিরপরাধের রক্ষক। যুদ্ধে অগ্রসর হতে হতে, আমাদের সামঞ্জস্যপূর্ণ বিশ্বাস আমাদের পথ নির্দেশ করুক এবং রক্ষা করুক। একসাথে, আমরা আমাদের পরিবার, আমাদের জনগণ এবং আলোয় স্নাত একটি ভবিষ্যতের জন্য লড়াই করি। এগিয়ে যান, একটি বিজয়ের জন্য যা যুগের মধ্যে প্রতিধ্বনি হবে!

source: Unleash the might of our seasoned warriors!
bn: আমাদের অভিজ্ঞ যোদ্ধাদের শক্তি মুক্তি দিন!

source: Advance, elite guardians of the light! Let us cleanse this land of the vampire scourge!
bn: এগিয়ে যান, আলোর অভিজাত রক্ষক! আসুন আমরা এই ভূমি থেকে ভ্যাম্পায়ারের অভিশাপ পরিষ্কার করি!

source: Beware, my nocturnal kin. The crusaders are cunning, with hidden reserves lurking. Do not underestimate their deceptive tactics. Stay vigilant and ruthless.
bn: সাবধান থাকো, আমার রাত্রিকালীন আত্মীয়রা। ক্রুসেডাররা চালাক, তাদের গোপন সেনাবাহিনী ওত পেতে আছে। তাদের প্রতারণামূলক কৌশলগুলিকে হালকাভাবে নেবেন না। সজাগ ও নির্দয় থাকুন।

source: Do these veinborn still dare to challenge our eternal might?
bn: এই রক্তজাতরা কি এখনও আমাদের চিরন্তন শক্তির সাথে চ্যালেঞ্জ নিতে সাহসী?

source: Enough! My children of the night, sweep these interlopers into oblivion. Their resistance wearies me.
bn: বাহ! আমার রাতের সন্তানেরা, এই অনুপ্রবেশকারীদের ভুলে যাওয়ার মধ্যে ঝাঁটা দিয়ে সরিয়ে দাও। তাদের প্রতিরোধ আমাকে ক্লান্ত করেছে।

source: <i>(coughing blood)</i> Damn...it all! They have taken...the Bastion!
bn: <i>(রক্ত কাশি)</i> ধিক্... সবকিছু! তারা নিয়ে গেছে...ব্যাস্টিয়নকে!

source: Ho Ho! I see that you blood-sucking vermin have reached my keep. No matter, my reserve forces shall deal with you!
bn: হা হা! আমি দেখতে পাচ্ছি যে তোমরা রক্তচোষা পোকামাকড় আমার দুর্গে পৌঁছে গেছো। কোনো ব্যাপার না, আমার সাহায্যকারী বাহিনী তোমাদের সাথে মোকাবিলা করবে!

source: Ah, the leeches of the night grace my camp! Fear not, for my hidden legions await to cleanse this blight!
bn: আহ, রাতের জোঁকেরা আমার শিবিরে এসেছে! ভয় পাবেন না, আমার গোপন সেনাবাহিনী এই অশুভ পরিস্কার করার জন্য অপেক্ষা করছে!

source: Ha! The night's pests swarm my encampment. Worry not, my reserve army stands ready to sweep you into oblivion!
bn: হা! রাতের পোকামাকড় আমার শিবিরে ভিড় করেছে। চিন্তা করবেন না, আমার সাহায্যকারী সেনাবাহিনী তোমাদের ভুলে যাওয়ার মধ্যে নিয়ে যেতে প্রস্তুত!

source: In defeat, I see the strength of our faith tested. We shall rise again, stronger and more resolute in our holy mission.
bn: পরাজয়ে, আমি আমাদের বিশ্বাসের শক্তি পরীক্ষিত হতে দেখি। আমরা আবার উঠবো, আমাদের পবিত্র মিশনে আরও শক্তিশালী ও দৃঢ়প্রতিজ্ঞ।

source: Though we falter today, the light guides us towards future victories. Our cause is just, and our resolve unshaken.
bn: যদিও আমরা আজ ব্যর্থ হয়েছি, আলো আমাদের ভবিষ্যতের জয়ের দিকে নির্দেশ করে। আমাদের কারণ ন্যায়সঙ্গত, এবং আমাদের সংকল্প অটুট।

source: This loss but tempers our spirit. We shall regroup, learn, and return with divine fury. Our crusade is far from over!
bn: এই পরাজয় কেবল আমাদের আত্মাকে শানিত করে। আমরা পুনরায় সংগঠিত হব, শিখব, এবং দৈবিক ক্রোধ নিয়ে ফিরে আসব। আমাদের ধর্মযুদ্ধ এখনও শেষ হয়নি!

source: My immortal brethren, behold our might! Three armies of the crusaders have fallen! In the darkness, we are unvanquished. To victory, eternal!
bn: আমার অমর ভাইয়েরা, আমাদের শক্তি দেখুন! ক্রুসেডারদের তিনটি সেনাবাহিনী পরাজিত হয়েছে! অন্ধকারে, আমরা অজেয়। অনন্ত বিজয়ের পথে!
